//************************************************************************* */
// 1. 스코프
// 정의: 범위 - 우리가 만든 변수나 함수에 접근하거나 호출할 수 있는 범위를 말함
// -> 전역(전체 영역) 스코프 / 지역 스코프
// -> 전체 스코프 : 전체 영역에서 접근 가능
// -> 지역 스코프 : 특정 영역에서만 접근 가능
//************************************************************************* */
function funcA(){ // a 접근 가능 영역 - 스코프
    let a = 1; // 함수 안에 a라는 변수에 접근 가능
}                 // a 접근 가능 영역 - 스코프
//console.log(a); // 함수 바깥에서는 a라는 변수에 접근 불가
console.log("/************************/");
//************************************************************************* */

let a = 1; // 전역 스코프

function funcA(){
    let b = 2; // 지역 스코프
    console.log(a);

    // 함수 지역 스코프
    function funcB(){

    }
}

funcA();
//console.log(b);
console.log("/************************/");
//************************************************************************* */
if(true){
    let c = 1; // 지역 스코프
}
console.log("/************************/");
//************************************************************************* */
for(let i = 0; i < 10; i++){
    let d = 1; // 지역 스코프
}
// console.log(d);

funcB(); // 지역 스코프라 함수 호출이 안됨